noccy80/mspdev/reference/MSP430ware/driverlib/5xx_6xx/gpio.c
    ASSERT(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 + 
                                     GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 + 
                                     GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 + 
                                     GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                     GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +  
                                     GPIO_PIN15
             )));

    switch (selectedPort){
        case GPIO_PORT_P1:
            HWREGB(baseAddress + OFS_P1OUT) &= ~selectedPins;
            break;
        case GPIO_PORT_P2:
            HWREGB(baseAddress + OFS_P2OUT) &= ~selectedPins;
            break;
        case GPIO_PORT_PA:
            HWREG(baseAddress + OFS_PAOUT) &= ~selectedPins;
            break;
    }
}

//*****************************************************************************
//
//! This function toggles the output on the selected Pin
//!
//! \param baseAddress is the base address of the GPIO Port Register
//! \param selectedPort is the selected port.
//!             Valid values are \b GPIO_PORT_P1, \b GPIO_PORT_P2,
//!             \b GPIO_PORT_P3, \b GPIO_PORT_P4,\b GPIO_PORT_P5,
//!             \b GPIO_PORT_P6, \b GPIO_PORT_P7,\b GPIO_PORT_P8,
//!             \b GPIO_PORT_P9, \b GPIO_PORT_P10,
//!             \b GPIO_PORT_P11, \b GPIO_PORT_PA,
//!             \b GPIO_PORT_PB, \b GPIO_PORT_PC,
//!             \b GPIO_PORT_PD, \b GPIO_PORT_PE,
//!             \b GPIO_PORT_PF, \b GPIO_PORT_PJ
//! \param selectedPins is the specified pin in the selected port.
//!             Valid values are \b GPIO_PIN0, \b GPIO_PIN1, \b GPIO_PIN2,
//!             \b GPIO_PIN3, \b GPIO_PIN4, \b GPIO_PIN5, \b GPIO_PIN6,
//!             \b GPIO_PIN7,\b GPIO_PIN8,\b GPIO_PIN9,\b GPIO_PIN10,
//!             \b GPIO_PIN11,\b GPIO_PIN12,\b GPIO_PIN13,\b GPIO_PIN14,
//!             \b GPIO_PIN15
//! Modified registers are \b PxOUT.
//!
//! \return None
//
//*****************************************************************************
void GPIO_toggleOutputOnPin (  unsigned int baseAddress,
    unsigned char selectedPort,
    unsigned int selectedPins
    )
{
    ASSERT((GPIO_PORT_P1 == selectedPort) ||
        (GPIO_PORT_P2 == selectedPort) ||
        (GPIO_PORT_P3 == selectedPort) ||
        (GPIO_PORT_P4 == selectedPort) ||
        (GPIO_PORT_P5 == selectedPort) ||
        (GPIO_PORT_P6 == selectedPort) ||
        (GPIO_PORT_P7 == selectedPort) ||
        (GPIO_PORT_P8 == selectedPort) ||
        (GPIO_PORT_P9 == selectedPort) ||
        (GPIO_PORT_P10 == selectedPort) ||
        (GPIO_PORT_P11 == selectedPort) ||
        (GPIO_PORT_PA == selectedPort) ||
        (GPIO_PORT_PB == selectedPort) ||
        (GPIO_PORT_PC == selectedPort) ||
        (GPIO_PORT_PD == selectedPort) ||
        (GPIO_PORT_PE == selectedPort) ||
        (GPIO_PORT_PF == selectedPort) ||
        (GPIO_PORT_PJ == selectedPort)
        );

    ASSERT(0x00 != (selectedPins & (GPIO_PIN0 + GPIO_PIN1 + GPIO_PIN2 + 
                                     GPIO_PIN3 + GPIO_PIN4 + GPIO_PIN5 + 
                                     GPIO_PIN6 + GPIO_PIN7 + GPIO_PIN8 + 
                                     GPIO_PIN9 + GPIO_PIN10 + GPIO_PIN11 +
                                     GPIO_PIN12 + GPIO_PIN13 + GPIO_PIN14 +  
                                     GPIO_PIN15
             )));

    switch (selectedPort){
        case GPIO_PORT_P1:
            HWREGB(baseAddress + OFS_P1OUT) ^= selectedPins;
            break;
        case GPIO_PORT_P2:
            HWREGB(baseAddress + OFS_P2OUT) ^= selectedPins;
            break;
        case GPIO_PORT_PA:
            HWREG(baseAddress + OFS_PAOUT) ^= selectedPins;
            break;
    }
}

//*****************************************************************************
//
//! This function sets the selected Pin in input Mode wuth Pull Down resistor
//!
//! \param baseAddress is the base address of the GPIO Port Register
//! \param selectedPort is the selected port.
//!             Valid values are \b GPIO_PORT_P1, \b GPIO_PORT_P2,
//!             \b GPIO_PORT_P3, \b GPIO_PORT_P4,\b GPIO_PORT_P5,
//!             \b GPIO_PORT_P6, \b GPIO_PORT_P7,\b GPIO_PORT_P8,
//!             \b GPIO_PORT_P9, \b GPIO_PORT_P10,
//!             \b GPIO_PORT_P11, \b GPIO_PORT_PA,
//!             \b GPIO_PORT_PB, \b GPIO_PORT_PC,
//!             \b GPIO_PORT_PD, \b GPIO_PORT_PE,
//!             \b GPIO_PORT_PF, \b GPIO_PORT_PJ
//! \param selectedPins is the specified pin in the selected port.
//!             Valid values are \b GPIO_PIN0, \b GPIO_PIN1, \b GPIO_PIN2,
//!             \b GPIO_PIN3, \b GPIO_PIN4, \b GPIO_PIN5, \b GPIO_PIN6,
//!             \b GPIO_PIN7,\b GPIO_PIN8,\b GPIO_PIN9,\b GPIO_PIN10,
//!             \b GPIO_PIN11,\b GPIO_PIN12,\b GPIO_PIN13,\b GPIO_PIN14,
//!             \b GPIO_PIN15
//! Modified registers are \b PxREN, \b PxOUT and \b PxDIR.
//!
//! \return None
//
//*****************************************************************************
void GPIO_setAsInputPinWithPullDownresistor (  unsigned int baseAddress,
    unsigned char selectedPort,
    unsigned int selectedPins
    )
{
    ASSERT((GPIO_PORT_P1 == selectedPort) ||
        (GPIO_PORT_P2 == selectedPort) ||
        (GPIO_PORT_P3 == selectedPort) ||
        (GPIO_PORT_P4 == selectedPort) ||
        (GPIO_PORT_P5 == selectedPort) ||
        (GPIO_PORT_P6 == selectedPort) ||
        (GPIO_PORT_P7 == selectedPort) ||
        (GPIO_PORT_P8 == selectedPort) ||
        (GPIO_PORT_P9 == selectedPort) ||
        (GPIO_PORT_P10 == selectedPort) ||
        (GPIO_PORT_P11 == selectedPort) ||
        (GPIO_PORT_PA == selectedPort) ||
        (GPIO_PORT_PB == selectedPort) ||
        (GPIO_PORT_PC == selectedPort) ||
        (GPIO_PORT_PD == selectedPort) ||
        (GPIO_PORT_PE == selectedPort) ||
        (GPIO_PORT_PF == selectedPort) ||
        (GPIO_PORT_PJ == selectedPort)
        );

